badgeteam/mch2022-firmware-esp32/main/main.c
    menu_free(menu);
}

void menu_wifi_settings(xQueueHandle buttonQueue, pax_buf_t* pax_buffer, ILI9341* ili9341, uint8_t* framebuffer, menu_action_t* menu_action) {
    menu_t* menu = menu_alloc("WiFi settings");
    *menu_action = ACTION_NONE;

    menu_args_t* wifi_scan_args = malloc(sizeof(menu_args_t));
    wifi_scan_args->action = ACTION_WIFI_SCAN;
    menu_insert_item(menu, "Add by scan...", NULL, wifi_scan_args, -1);
    
    menu_args_t* wifi_manual_args = malloc(sizeof(menu_args_t));
    wifi_manual_args->action = ACTION_WIFI_MANUAL;
    menu_insert_item(menu, "Add manually...", NULL, wifi_manual_args, -1);
    
    menu_args_t* wifi_list_args = malloc(sizeof(menu_args_t));
    wifi_list_args->action = ACTION_WIFI_LIST;
    menu_insert_item(menu, "List known networks", NULL, wifi_list_args, -1);
    
    menu_args_t* back_args = malloc(sizeof(menu_args_t));
    back_args->action = ACTION_BACK;
    menu_insert_item(menu, "< Back", NULL, back_args, -1);

    bool render = true;
    menu_args_t* menuArgs = NULL;

    while (1) {
        rp2040_input_message_t buttonMessage = {0};
        if (xQueueReceive(buttonQueue, &buttonMessage, 16 / portTICK_PERIOD_MS) == pdTRUE) {
            uint8_t pin = buttonMessage.input;
            bool value = buttonMessage.state;
            switch(pin) {
                case RP2040_INPUT_JOYSTICK_DOWN:
                    if (value) {
                        menu_navigate_next(menu);
                        render = true;
                    }
                    break;
                case RP2040_INPUT_JOYSTICK_UP:
                    if (value) {
                        menu_navigate_previous(menu);
                        render = true;
                    }
                    break;
                case RP2040_INPUT_BUTTON_ACCEPT:
                    if (value) {
                        menuArgs = menu_get_callback_args(menu, menu_get_position(menu));
                    }
                    break;
                default:
                    break;
            }
        }

        if (render) {
            graphics_task(pax_buffer, ili9341, framebuffer, menu, NULL);
            render = false;
        }
        
        if (menuArgs != NULL) {
            *menu_action = menuArgs->action;
            break;
        }
    }
    
    for (size_t index = 0; index < menu_get_length(menu); index++) {
        free(menu_get_callback_args(menu, index));
    }
    
    menu_free(menu);
}

void flush_stdin() {
    uint8_t* data = malloc(2048);
    uart_read_bytes(0, data, 2048 - 1, 20 / portTICK_PERIOD_MS);
    free(data);
    /*while (true) {
        char in = getc(stdin);
        if (in == 0xFF) {
            break;
        }
    }*/
}

bool read_stdin(uint8_t* buffer, uint32_t len, uint32_t timeout) {
    int read = uart_read_bytes(0, buffer, len, timeout / portTICK_PERIOD_MS);
    return (read == len);
    
    /*uint8_t index = 0;
    uint32_t timeout_counter = 0;
    while (index < len) {
        char in = getc(stdin);
        if (in != 0xFF) {
            buffer[index] = in;
            index++;
        } else {
            vTaskDelay(10 / portTICK_PERIOD_MS);
            timeout_counter+=10;
            if (timeout_counter > timeout) {
                return false;
            }
        }
    }
    return true;*/
}

bool rp2040_bl_sync() {
    flush_stdin();
    char command[] = "SYNC";
    uart_write_bytes(0, command, 4);
    uint8_t rx_buffer[4 * 6];
    read_stdin(rx_buffer, sizeof(rx_buffer), 1000);
    if (memcmp(rx_buffer, "PICO", 4) != 0) return false;
    return true;
}

bool rp2040_bl_get_info(uint32_t* flash_start, uint32_t* flash_size, uint32_t* erase_size, uint32_t* write_size, uint32_t* max_data_len) {
    flush_stdin();
    char command[] = "INFO";
    uart_write_bytes(0, command, 4);
    /*printf("INFO");*/
    uint8_t rx_buffer[4 * 6];
    read_stdin(rx_buffer, sizeof(rx_buffer), 1000);
    if (memcmp(rx_buffer, "OKOK", 4) != 0) return false;
    memcpy((uint8_t*) flash_start,  &rx_buffer[4 * 1], 4);
    memcpy((uint8_t*) flash_size,   &rx_buffer[4 * 2], 4);
    memcpy((uint8_t*) erase_size,   &rx_buffer[4 * 3], 4);
    memcpy((uint8_t*) write_size,   &rx_buffer[4 * 4], 4);
    memcpy((uint8_t*) max_data_len, &rx_buffer[4 * 5], 4);
    return true;
}

bool rp2040_bl_erase(uint32_t address, uint32_t length) {
    flush_stdin();
    char command[12];
    snprintf(command, 5, "ERAS");
    memcpy(command + 4, (char*) &address, 4);
    memcpy(command + 8, (char*) &length, 4);
    uart_write_bytes(0, command, sizeof(command));
    /*printf("ERAS");
    uint8_t* addres_u8 = (uint8_t*) &address;
    putc(addres_u8[0], stdout);
    putc(addres_u8[1], stdout);
    putc(addres_u8[2], stdout);
    putc(addres_u8[3], stdout);
    uint8_t* length_u8 = (uint8_t*) &length;
    putc(length_u8[0], stdout);
    putc(length_u8[1], stdout);
    putc(length_u8[2], stdout);
    putc(length_u8[3], stdout);*/
    uint8_t rx_buffer[4];
    read_stdin(rx_buffer, sizeof(rx_buffer), 10000);
    if (memcmp(rx_buffer, "OKOK", 4) != 0) return false;
    return true;
}

bool rp2040_bl_write(uint32_t address, uint32_t length, uint8_t* data, uint32_t* crc) {
    flush_stdin();
    char command[12];
    snprintf(command, 5, "WRIT");
    memcpy(command + 4, (char*) &address, 4);
    memcpy(command + 8, (char*) &length, 4);
    uart_write_bytes(0, command, sizeof(command));
    /*printf("WRIT");
    uint8_t* addres_u8 = (uint8_t*) &address;
    putc(addres_u8[0], stdout);
    putc(addres_u8[1], stdout);
    putc(addres_u8[2], stdout);
    putc(addres_u8[3], stdout);
    uint8_t* length_u8 = (uint8_t*) &length;
    putc(length_u8[0], stdout);
    putc(length_u8[1], stdout);
    putc(length_u8[2], stdout);
    putc(length_u8[3], stdout);
    
    for (uint32_t index = 0; index < length; index++) {
        putc(data[index], stdout);
    }*/
    
    uart_write_bytes(0, data, length);
    
    
    uint8_t rx_buffer[8];
    read_stdin(rx_buffer, sizeof(rx_buffer), 10000);
    if (memcmp(rx_buffer, "OKOK", 4) != 0) return false;
    
    memcpy((uint8_t*) crc, &rx_buffer[4 * 1], 4);
    return true;
}

bool rp2040_bl_seal(uint32_t addr, uint32_t vtor, uint32_t length, uint32_t crc) {
    flush_stdin();
    char command[20];
    snprintf(command, 5, "SEAL");
    memcpy(command + 4, (char*) &addr, 4);
    memcpy(command + 8, (char*) &vtor, 4);
    memcpy(command + 12, (char*) &length, 4);
    memcpy(command + 16, (char*) &crc, 4);
    uart_write_bytes(0, command, sizeof(command));
    uint8_t rx_buffer[4];
    read_stdin(rx_buffer, sizeof(rx_buffer), 10000);
    if (memcmp(rx_buffer, "OKOK", 4) != 0) return false;
    return true;
}

bool rp2040_bl_go(uint32_t vtor) {
    flush_stdin();
    char command[8];
    snprintf(command, 5, "GOGO");
    memcpy(command + 4, (char*) &vtor, 4);
    uart_write_bytes(0, command, sizeof(command));
    return true;
}

