badgeteam/mch2022-firmware-esp32/main/main.c
void app_main(void) {
    flush_stdin();
    esp_err_t res;
    
    /* Initialize memory */
    uint8_t* framebuffer = heap_caps_malloc(ILI9341_BUFFER_SIZE, MALLOC_CAP_8BIT);
    if (framebuffer == NULL) {
        ESP_LOGE(TAG, "Failed to allocate framebuffer");
        restart();
    }
    memset(framebuffer, 0, ILI9341_BUFFER_SIZE);
    
    pax_buf_t* pax_buffer = malloc(sizeof(pax_buf_t));
    if (framebuffer == NULL) {
        ESP_LOGE(TAG, "Failed to allocate pax buffer");
        restart();
    }
    memset(pax_buffer, 0, sizeof(pax_buf_t));
    
    pax_buf_init(pax_buffer, framebuffer, ILI9341_WIDTH, ILI9341_HEIGHT, PAX_BUF_16_565RGB);
    driver_framebuffer_init(framebuffer);
    
    /* Initialize hardware */
    
    bool lcdReady = false;
    res = board_init(&lcdReady);
    
    if (res != ESP_OK) {
        if (lcdReady) {
            ILI9341* ili9341 = get_ili9341();
            graphics_task(pax_buffer, ili9341, framebuffer, NULL, "Hardware error!");
        }
        printf("Failed to initialize hardware!\n");
        restart();
    }
    
    ILI9341* ili9341 = get_ili9341();
    ICE40* ice40 = get_ice40();
    BNO055* bno055 = get_bno055();
    RP2040* rp2040 = get_rp2040();

    graphics_task(pax_buffer, ili9341, framebuffer, NULL, "AppFS init...");
    res = appfs_init();
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "AppFS init failed: %d", res);
        graphics_task(pax_buffer, ili9341, framebuffer, NULL, "AppFS init failed!");
        return;
    }
    ESP_LOGI(TAG, "AppFS initialized");
    
    graphics_task(pax_buffer, ili9341, framebuffer, NULL, "NVS init...");
    res = nvs_init();
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "NVS init failed: %d", res);
        graphics_task(pax_buffer, ili9341, framebuffer, NULL, "NVS init failed!");
        return;
    }
    ESP_LOGI(TAG, "NVS initialized");
    
    graphics_task(pax_buffer, ili9341, framebuffer, NULL, "Mount SD card...");
    res = mount_sd(SD_CMD, SD_CLK, SD_D0, SD_PWR, "/sd", false, 5);
    bool sdcard_ready = (res == ESP_OK);
  
    if (sdcard_ready) {
        graphics_task(pax_buffer, ili9341, framebuffer, NULL, "SD card mounted");
    }
    
    ws2812_init(GPIO_LED_DATA);
    uint8_t ledBuffer[15] = {50, 0, 0, 50, 0, 0, 50, 0, 0, 50, 0, 0, 50, 0, 0};
    ws2812_send_data(ledBuffer, sizeof(ledBuffer));
    
    uint8_t fw_version;
    if (rp2040_get_firmware_version(rp2040, &fw_version) != ESP_OK) {
        graphics_task(pax_buffer, ili9341, framebuffer, NULL, "RP2040 FW VERSION READ FAILED");
        restart();
    }
    
    if (fw_version == 0xFF) {
        // RP2040 is in bootloader mode
        char buffer[255] = {0};
        graphics_task(pax_buffer, ili9341, framebuffer, NULL, "Updating RP2040...");
        vTaskDelay(1 / portTICK_PERIOD_MS);
        uint8_t bl_version;
        if (rp2040_get_bootloader_version(rp2040, &bl_version) != ESP_OK) {
            graphics_task(pax_buffer, ili9341, framebuffer, NULL, "Communication error (1)");
            restart();
        }
        if (bl_version != 0x01) {
            graphics_task(pax_buffer, ili9341, framebuffer, NULL, "Unknown BL version");
            restart();
        }
        
        ESP_ERROR_CHECK(uart_driver_install(0, 2048, 0, 0, NULL, 0));
        uart_config_t uart_config = {
            .baud_rate = 115200,
            .data_bits = UART_DATA_8_BITS,
            .parity    = UART_PARITY_DISABLE,
            .stop_bits = UART_STOP_BITS_1,
            .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
            .source_clk = UART_SCLK_APB,
        };
        ESP_ERROR_CHECK(uart_param_config(0, &uart_config));
        
        graphics_task(pax_buffer, ili9341, framebuffer, NULL, "Waiting for bootloader...");
        while (true) {
            vTaskDelay(1 / portTICK_PERIOD_MS);
            uint8_t bl_state;
            if (rp2040_get_bootloader_state(rp2040, &bl_state) != ESP_OK) {
                graphics_task(pax_buffer, ili9341, framebuffer, NULL, "Communication error (2)");
                restart();
            }
            if (bl_state == 0xB0) {
                graphics_task(pax_buffer, ili9341, framebuffer, NULL, "Bootloader ready");
                break;
            }
            if (bl_state > 0xB0) {
                graphics_task(pax_buffer, ili9341, framebuffer, NULL, "Unknown BL state");
                restart();
            }
        }
        
        graphics_task(pax_buffer, ili9341, framebuffer, NULL, "Sync to BL...");
        char rx_buffer[16];
        uint8_t rx_buffer_pos = 0;
        memset(rx_buffer, 0, sizeof(rx_buffer));
        while (true) {
            //printf("SYNC");
            
            //uint8_t rx_buffer[4];
            //read_stdin(rx_buffer, sizeof(rx_buffer), 1000);
            
            /*char in = 0xFF;
            do {
                in = getc(stdin);
                if (in != 0xFF) {
                    rx_buffer[rx_buffer_pos] = in;
                    rx_buffer_pos++;
                }
            } while ((in != 0xFF) && (rx_buffer_pos < sizeof(rx_buffer)));*/
            
            //if (memcmp(rx_buffer, "PICO", 4) == 0) {
            //    break;
            //}
            
            /*if (rx_buffer_pos >= 4) {
                for (uint8_t i = 0; i < sizeof(rx_buffer) - 1; i++) {
                    rx_buffer[i] = rx_buffer[i+1];
                    if (memcmp(rx_buffer, "PICO", 4) == 0) {
                        break;
                    }
                }
                rx_buffer_pos--;
            }*/
            
            flush_stdin();
            if (rp2040_bl_sync()) break;
            
            vTaskDelay(500 / portTICK_PERIOD_MS);
        }
        graphics_task(pax_buffer, ili9341, framebuffer, NULL, "Synced to BL!");
        
        /*char in = 0xFF;
        do {
            in = getc(stdin);
        } while (in != 0xFF);*/
        flush_stdin();
        
        uint32_t flash_start = 0, flash_size = 0, erase_size = 0, write_size = 0, max_data_len = 0;
        
